app/controllers/events_controller.rb

	def index
		@event = Event.all
---
SELECT `events`.* FROM `events`

	def event
		@event = Event.where(:id => params[:diaskedasi]).first
---
SELECT  `events`.* FROM `events`  WHERE `events`.`id` = 1  ORDER BY `events`.`id` ASC LIMIT 1