app/controllers/gallery_controller.rb

  def index
  	@gallery = Gallery.all
---
SELECT `galleries`.* FROM `galleries`

  def gallery
  	@album = Album.where(:gallery_id => params[:album])
  	@gallery = Gallery.where(:id => params[:album]).first
---
SELECT `albums`.* FROM `albums`  WHERE `albums`.`gallery_id` IS NULL
SELECT  `galleries`.* FROM `galleries`  WHERE `galleries`.`id` IS NULL  ORDER BY `galleries`.`id` ASC LIMIT 1