app/controllers/menu_controller.rb

	def index
		@menu = Menu.all
---
SELECT `menus`.* FROM `menus`