app/controllers/story_controller.rb

SELECT `stories`.* FROM `stories`
---
	def index
		@story = Story.all